#include <iostream>
#include <vector>

int main() {
    int table[2][6] = {{ 1, 1, 1, 1, 1, 1},
                       { 1, 1, 1, 1, 1, 1}};

    int tableware[2][6] = {{ 4, 3, 3, 3, 3, 3},
                           { 4, 3, 3, 3, 3, 3}};

    int dishes[2][6] = {{ 3, 2, 2, 2, 2, 2},
                        { 3, 2, 2, 2, 2, 2}};

    int chairs[2][6] = {{ 1, 1, 1, 1, 1, 1},
                       { 1, 1, 1, 1, 1, 1}};

    table[0][4] += 1; // женщина+ребенок
    chairs[0][4] += 1; // ей принесли доп. стул
    tableware[1][2] -= 1; // пропала вилка
    tableware[0][0] -= 1; // ВИП отдает свою ложку
    tableware[1][2] += 1; // человек с пропавшей вилкой получает ложку
    dishes[0][0] -= 1; // официант забрал у щедрого ВИПа десертную тарелку


    return 0;
}
